Sparkleiot/BK7239N_AT/components/bk_mcuboot/bl2/components/download/bl_bk_reg.h

#ifndef _bk3000_CHIP_H_
#define _bk3000_CHIP_H_

#include "bl_config.h"
#include <soc/soc.h>

#define ENABLE   1
#define DISABLE  0




// AMBA Address Mapping
/////////////// CHANGE /////////////////
// AHB
#if (CHIP_BK3281)
#define BK3000_PMU_BASE_ADDR              0x00800000
#define BK3000_FLASH_BASE_ADDR            0x00801000

#define BK3000_ICU_BASE_ADDR              0x00F00000
#define BK3000_UART_BASE_ADDR             0x00F08000

#define BK3000_SPI_BASE_ADDR              0x00F38000
#define BK3000_GPIO_BASE_ADDR             0x00F40000
#define BK3000_WDT_BASE_ADDR              0x00F48000

#define REG_XVR_BASE_ADDR              	  0x00800000
#define ANA_XVR_NUM 16

#define BK3000_PMU_ROM_FLASH_SECT        				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0xb*4)))


//watchdog

#define BK3000_WDT_CONFIG                    		(*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+0*4)))
// PMU define
#define BK3000_PMU_CONFIG          						  (*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0*4)))
#define BK3000_PMU_PERI_PWDS        						(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 1*4)))
#define BK3000_PMU_PERINT_ENABLE        				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 4*4)))




#define BK3000_PMU_INTC_ENABLE        					(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 6*4)))
#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_GPIO_BASE_ADDR + 0x3f*4)))
#define DEEP_SLEEP_RESTART		(0x1 << 0)


#define bit_PMU_UART_PWD                  (1<<1)
#define bit_PMU_SPI_PWD                   (1<<7)
#define bit_PMU_WDT_PWD                   (1<<9)
#define bit_PMU_ICU_PWD                   (1<<20)
#define bit_PMU_FLASH_PWD                 (1<<21)

#endif

#if (CHIP_BK3266)
#define BK3000_PMU_BASE_ADDR              0x00800000
#define BK3000_FLASH_BASE_ADDR            0x00801000

#define BK3000_ICU_BASE_ADDR              0x00F10000
#define BK3000_UART_BASE_ADDR             0x00F08000

#define BK3000_SPI_BASE_ADDR              0x00F38000
#define BK3000_GPIO_BASE_ADDR             0x00F40000
#define BK3000_WDT_BASE_ADDR              0x00F48000

#define REG_XVR_BASE_ADDR                 0x00F00000
#define ANA_XVR_NUM 16

#define BK3000_PMU_ROM_FLASH_SECT        				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x7*4)))

//watchdog

#define BK3000_WDT_CONFIG                    		(*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+0*4)))
// PMU define
#define BK3000_PMU_CONFIG          						  (*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0*4)))
#define BK3000_PMU_PERI_PWDS        						(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 1*4)))
#define BK3000_PMU_PERINT_ENABLE        				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 4*4)))
#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_GPIO_BASE_ADDR + 0x3f*4)))
#define DEEP_SLEEP_RESTART		(0x1 << 0)




#define sft_PMU_CPU_CLK_DIV               1
#define sft_PMU_CPU_CLK_SEL               8
#define PMU_AHB_CLK_ALWAYS_ON             (1<<10)

#define bit_PMU_UART_PWD                  (1<<2)

#define bit_PMU_SPI_PWD                   (1<<8)

#define bit_PMU_LPO_CLK_DISABLE           (1<<23)
#define bit_PMU_LPO_CLK_STEAL_ENABLE      (1<<24)
#define bit_PMU_LPO_CLK_SEL_XTAL          (1<<25)
#define bit_PMU_CLK_FREQ_SEL              (1<<31)

#endif


#if (CHIP_BK3288)
#define BK3000_SYS_BASE_ADDR              0x01000000
#define BK3000_UART_BASE_ADDR             0x01808000
//#define BK3000_FLASH_BASE_ADDR            0x00801000
#define BK3000_SPI_BASE_ADDR              0x01820000
#define BK3000_WDT_BASE_ADDR              0x01890000
#define BK3000_GPIO_BASE_ADDR             0x01000c00
#define REG_XVR_BASE_ADDR                 0x01910000
#define ANA_XVR_NUM 16
#define BK3000_PMU_ROM_FLASH_SECT        				(*((volatile unsigned int *)(BK3000_SYS_BASE_ADDR + 0xe*4)))
#define BK3000_PMU_BASE_ADDR             0x01000800

//watchdog
#define BK3000_WDT_CONFIG                    		(*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+0*4)))
// PMU define
#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x1*4)))
#define DEEP_SLEEP_RESTART		(0x1 << 0)



//Peri clock pwd
#define addSYSTEM_Reg0x5                                        *((volatile unsigned long *) (0x01000000+0x5*4))
#define UART0CLK_PWD                (0x1U << 0 )
#define SPI0CLK_PWD                 (0x1U << 3 )
//#define WDTCLK_PWD                  (0x1U << 18)
#define SET_PERIxCLK(bit)           addSYSTEM_Reg0x5 &= ~bit
#define CLR_PERIxCLK(bit)           addSYSTEM_Reg0x5 |= bit

//addSYSTEM_Reg0x9
#define addSYSTEM_Reg0x9                                        *((volatile unsigned long *) (0x01000000+0x9*4))
#define INT_ID_UART0   (0x1U << 22 )
#define VIC_UART_ISR_INDEX            22


#define addSYSTEM_Reg0x1d                                        *((volatile unsigned long *) (0x01000000+0x1d*4))
#define set_spi_rw_flash                                   addSYSTEM_Reg0x1d  |= 0x4
#define set_flashctrl_rw_flash                             addSYSTEM_Reg0x1d  &= ~0x4

#define addSYSTEM_Reg0x21                                        *((volatile unsigned long *) (0x01000000+0x21*4))
#define clr_ram_sd(bit)           addSYSTEM_Reg0x21  &= ~bit
#define set_ram_sd(bit)            addSYSTEM_Reg0x21 |= bit
#define uart0_ram_sd   (0x1U << 0 )
#define spi0_ram_sd    (0x1U << 3 )



#endif


#if (CHIP_BK3633)

#define BK3000_SYS_BASE_ADDR              0x00800000
#define BK3000_UART_BASE_ADDR             0x00806300
//#define BK3000_FLASH_BASE_ADDR            0x00801000
#define BK3000_SPI_BASE_ADDR              0x00806200
#define BK3000_WDT_BASE_ADDR               0x00806000
#define BK3000_AWDT_BASE_ADDR              0x00800c00
#define BK3000_GPIO_BASE_ADDR             0x00800a00
#define REG_XVR_BASE_ADDR                 0x00806e00
#define ANA_XVR_NUM 16
#define BK3000_PMU_BASE_ADDR              0x00800800

//watchdog
#define BK3000_WDT_CONFIG                    		(*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+0*4)))

#define AON_WDT_FEED                    		(*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+1*4)))
#define AON_WDT_PERIOD                  		(*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+2*4)))


// PMU define
#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x1*4)))
#define DEEP_SLEEP_RESTART_BIT		(0x1 << 0)
// 1: Boot from deep_sleep  0: Boot from POR 
#define DEEP_SLEEP_RESTART   ((BK3000_PMU_RESET_REASON_GET & DEEP_SLEEP_RESTART_BIT ) != 0)

