Sparkleiot/BK7239N_AT/components/bk_mcuboot/bl2/components/download/bl_bk_reg.h
//uart enable
#define addSYSTEM_Reg0x3          *((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0x3*4))
#define UART0CLK_PWD_BIT          (0x1U << 0 )
#define UART0_ENABLE    (addSYSTEM_Reg0x3) &= ~UART0CLK_PWD_BIT 
#define UART0_DISABLE   (addSYSTEM_Reg0x3) |=  UART0CLK_PWD_BIT  

//spi enable
//#define addSYSTEM_Reg0x5            *((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0x5*4))
#define SPI0CLK_PWD_BIT             (0x1U << 13 )	
#define SPI0_ENABLE    (addSYSTEM_Reg0x3) &= ~SPI0CLK_PWD_BIT 
#define SPI0_DISABLE   (addSYSTEM_Reg0x3) |=  SPI0CLK_PWD_BIT  

//uart int enable
 
//#define addSYSTEM_Reg0x11       (*((volatile unsigned int *)(BK3000_SYS_BASE_ADDR + 0x11*4)))
//#define IRQ_BIT           (0x01<< 0)
//#define IRQ_ENABLE       addSYSTEM_Reg0x11 |= IRQ_BIT
//#define IRQ_DISABLE      addSYSTEM_Reg0x11 &= ~IRQ_BIT

#define INT_STATUS   (*((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0x12*4)))
#define UART0_INT_INDEX         (0x1U << 4 )	
#define UART0_INT_STATUS   (INT_STATUS & UART0_INT_INDEX )
#define IRQ_INT_CLEAR      INT_STATUS = INT_STATUS

#define PER_INT_ENABLE   (*((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0x10*4)))
#define UART0_INT_ENABLE   PER_INT_ENABLE |=  UART0_INT_INDEX
#define UART0_INT_DISABLE  PER_INT_ENABLE &=  ~UART0_INT_INDEX

// flash_rw_sel & rebooot
#define addSYSTEM_Reg0xf    (*((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0xf*4)))
#define  SPI_FLASH_SEL      (0x1U << 1 )	 
#define  SET_SPI_RW_FLASH          addSYSTEM_Reg0xf |= SPI_FLASH_SEL 
#define  SET_FLASHCTRL_RW_FLASH    addSYSTEM_Reg0xf &= ~SPI_FLASH_SEL 

#define  BOOT_BIT      (0x1U << 0 )	
#define  REBOOT        addSYSTEM_Reg0xf &= ~BOOT_BIT  




#define UART_CLOCK_FREQ      16000000


#endif




#if (CHIP_BK7256)

#define BK3000_SYS_BASE_ADDR              0x44010000
#define BK3000_UART_BASE_ADDR             0x44820000
#define BK3000_SPI_BASE_ADDR              0x44860000
#define BK3000_WDT_BASE_ADDR               0x44800000
#define BK3000_GPIO_BASE_ADDR             0x44000400
#define BK3000_AWDT_BASE_ADDR             0x44000600
#define REG_XVR_BASE_ADDR                 0x4a800000
#define ANA_XVR_NUM                       16
#define BK3000_PMU_BASE_ADDR              0x44000000

//watchdog
#define BK3000_WDT_CONFIG                    		(*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+0*4)))

#define AON_WDT_CONFIG                     		(*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+0*4)))
//#define AON_WDT_FEED                    		(*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+1*4)))
//#define AON_WDT_PERIOD                  		(*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+2*4)))


// PMU define
#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x3*4)))
#define DEEP_SLEEP_RESTART_BIT		(0x1 << 0)
// 1: Boot from deep_sleep  0: Boot from POR
#define DEEP_SLEEP_RESTART   ((BK3000_PMU_RESET_REASON_GET & DEEP_SLEEP_RESTART_BIT ) != 0)


//uart enable _ok
#define addSYSTEM_Reg0xc                            *((volatile unsigned long *) (0x44010000+0xc*4))
#define UART0_ENABLE                                addSYSTEM_Reg0xc |= 0x4
#define UART0_DISABLE                               addSYSTEM_Reg0xc &= ~0x4

//spi enable _ok
#define SPI0_ENABLE                            addSYSTEM_Reg0xc |= 0x2
#define SPI0_DISABLE                            addSYSTEM_Reg0xc &= ~0x2


//uart int enable

//#define addSYSTEM_Reg0x11       (*((volatile unsigned int *)(BK3000_SYS_BASE_ADDR + 0x11*4)))
//#define IRQ_BIT           (0x01<< 0)
//#define IRQ_ENABLE       addSYSTEM_Reg0x11 |= IRQ_BIT
//#define IRQ_DISABLE      addSYSTEM_Reg0x11 &= ~IRQ_BIT

//#define INT_STATUS   (*((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0x12*4)))
//#define UART0_INT_INDEX         (0x1U << 4 )
//#define UART0_INT_STATUS   (INT_STATUS & UART0_INT_INDEX )
//#define IRQ_INT_CLEAR      INT_STATUS = INT_STATUS

//#define PER_INT_ENABLE   (*((volatile unsigned long *) (BK3000_SYS_BASE_ADDR+0x10*4)))
//#define UART0_INT_ENABLE   PER_INT_ENABLE |=  UART0_INT_INDEX
//#define UART0_INT_DISABLE  PER_INT_ENABLE &=  ~UART0_INT_INDEX

////////////////////ok


#define PER_INT_ENABLE   *((volatile unsigned long *) (0x44010000+0x20*4))
#define UART0_INT_INDEX_NUM          4
#define UART0_INT_INDEX         (0x1U << 4 )
#define UART0_INT_ENABLE   PER_INT_ENABLE |=  UART0_INT_INDEX
#define UART0_INT_DISABLE  PER_INT_ENABLE &=  ~UART0_INT_INDEX

/////////////////

// flash_rw_sel & rebooot   ok


#define addSYSTEM_Reg0x3                                        *((volatile unsigned long *) (0x44010000+0x3*4))
#define REBOOT                                                  addSYSTEM_Reg0x3 &= ~0x1
#define  SPI_FLASH_SEL             (0x1U << 9 )
#define  SET_SPI_RW_FLASH          addSYSTEM_Reg0x3 |= SPI_FLASH_SEL
#define  SET_FLASHCTRL_RW_FLASH    addSYSTEM_Reg0x3 &= ~SPI_FLASH_SEL


#define UART_CLOCK_FREQ      26000000

#endif




#if (CHIP_BK7236)

#define BK3000_SYS_BASE_ADDR              0x44010000
#define BK3000_UART_BASE_ADDR             0x44820000
#define BK3000_SPI_BASE_ADDR              0x44870000
#define BK3000_WDT_BASE_ADDR              0x44800000
#define BK3000_GPIO_BASE_ADDR             0x44000400
#define BK3000_AWDT_BASE_ADDR             0x44000600
#define REG_XVR_BASE_ADDR                 0x4a800000
#define ANA_XVR_NUM                       16
#define BK3000_PMU_BASE_ADDR              0x44000000

//watchdog
#define BK3000_WDT_CONTROL                   (*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+2*4)))
#define BK3000_WDT_CONFIG                   (*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+4*4)))

#define AON_WDT_CONFIG                      (*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+0*4)))
//#define AON_WDT_FEED                      (*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+1*4)))
//#define AON_WDT_PERIOD                    (*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+2*4)))


// PMU define

#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x0*4)))

#define AON_PMU_REG01          				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x1*4)))
#define AON_PMU_REG01_BIT_XTAL_MODE                     (0x1 << 21)
#define AON_PMU_IS_XTAL_40M                             ((AON_PMU_REG01 & AON_PMU_REG01_BIT_XTAL_MODE) == 1)
#define AON_PMU_REG41          				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x41*4)))
#define AON_PMU_REG41_BIT_XTAL_SEL                      (0x1 << 14)
#define AON_PMU_SET_XTAL_26M                            AON_PMU_REG41 &= ~AON_PMU_REG41_BIT_XTAL_SEL
#define AON_PMU_SET_XTAL_40M                            AON_PMU_REG41 |= AON_PMU_REG41_BIT_XTAL_SEL
#define AON_PMU_IS_XTAL_SEL_40M                         ((AON_PMU_REG41 & AON_PMU_REG41_BIT_XTAL_SEL) == 1)

