Sparkleiot/BK7239N_AT/components/bk_mcuboot/bl2/components/download/bl_bk_reg.h
#define AON_PMU_REG03            		            (*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x3*4)))

#define AON_PMU_REG03_BIT_BOOT_FLAG                 0x1
#define AON_PMU_REG03_SET_BF_PRIMARY                AON_PMU_REG03 |= AON_PMU_REG03_BIT_BOOT_FLAG
#define AON_PMU_REG03_CLR_BF_PRIMARY                AON_PMU_REG03 &= ~AON_PMU_REG03_BIT_BOOT_FLAG

#define DEEP_SLEEP_RESTART_BIT		(0x1 << 1)
// 1: Boot from deep_sleep  0: Boot from POR
#define DEEP_SLEEP_RESTART   ((BK3000_PMU_RESET_REASON_GET & DEEP_SLEEP_RESTART_BIT ) != 0)


//uart enable _ok
#define addSYSTEM_Reg0xc                            *((volatile unsigned long *) (0x44010000+0xc*4))
#define UART0_ENABLE                                addSYSTEM_Reg0xc |= 0x4
#define UART0_DISABLE                               addSYSTEM_Reg0xc &= ~0x4
#define UART0_RESET                                 REG_APB3_UART_RST = 1


//spi enable _ok
#define SPI0_ENABLE                            addSYSTEM_Reg0xc |= 0x2
#define SPI0_DISABLE                            addSYSTEM_Reg0xc &= ~0x2

#define PER_INT_ENABLE   *((volatile unsigned long *) (0x44010000+0x20*4))
#define UART0_INT_INDEX_NUM          4
#define UART0_INT_INDEX         (0x1U << 4 )
#define UART0_INT_ENABLE   PER_INT_ENABLE |=  UART0_INT_INDEX
#define UART0_INT_DISABLE  PER_INT_ENABLE &=  ~UART0_INT_INDEX

/////////////////

// flash_rw_sel & rebooot   ok


#define addSYSTEM_Reg0x2                                        *((volatile unsigned long *) (0x44010000+0x2*4))
#define REBOOT                                                  addSYSTEM_Reg0x2 &= ~0x1
#define  SPI_FLASH_SEL             (0x1U << 9 )
#define  SET_SPI_RW_FLASH          addSYSTEM_Reg0x2 |= SPI_FLASH_SEL
#define  SET_FLASHCTRL_RW_FLASH    addSYSTEM_Reg0x2 &= ~SPI_FLASH_SEL


uint32_t uart_get_clock_freq(void);
#define UART_CLOCK_FREQ      uart_get_clock_freq()
#define UART_CLOCK_FREQ_26M  26000000
#define UART_CLOCK_FREQ_40M  40000000

#endif

#if (CHIP_BK7236N) || (CHIP_BK7239)

#define REG_AND(r, data) do {\
		uint32_t v = REG_READ((r));\
		v &= (data);\
		REG_WRITE((r), v);\
	} while(0)

#define REG_ANA_OR(r, data) do {\
		uint32_t v = REG_READ((r));\
		v |= (data);\
		REG_WRITE((r), v);\
	} while(0)

#define BK3000_SYS_BASE_ADDR              0x44010000
#define BK3000_UART_BASE_ADDR             0x44820000
#define BK3000_SPI_BASE_ADDR              0x44870000
#define BK3000_WDT_BASE_ADDR              0x44800000
#define BK3000_GPIO_BASE_ADDR             0x44000400
#define REG_XVR_BASE_ADDR                 0x4a800000
#define ANA_XVR_NUM                       16
#define BK3000_PMU_BASE_ADDR              0x44000000

//watchdog
#define BK3000_WDT_CONTROL                   (*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+2*4)))
#define BK3000_WDT_CONFIG                   (*((volatile unsigned long *)(BK3000_WDT_BASE_ADDR+4*4)))

// #define AON_WDT_CONFIG                      (*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+0*4)))
//#define AON_WDT_FEED                      (*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+1*4)))
//#define AON_WDT_PERIOD                    (*((volatile unsigned long *)(BK3000_AWDT_BASE_ADDR+2*4)))


// PMU define

#define BK3000_PMU_RESET_REASON_GET          		(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x0*4)))

#define AON_PMU_REG01          				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x1*4)))
#define AON_PMU_REG01_BIT_XTAL_MODE                     (0x1 << 21)
#define AON_PMU_IS_XTAL_40M                             ((AON_PMU_REG01 & AON_PMU_REG01_BIT_XTAL_MODE) == 1)
#define AON_PMU_REG41          				(*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x41*4)))
#define AON_PMU_REG41_BIT_XTAL_SEL                      (0x1 << 14)
#define AON_PMU_SET_XTAL_26M                            AON_PMU_REG41 &= ~AON_PMU_REG41_BIT_XTAL_SEL
#define AON_PMU_SET_XTAL_40M                            AON_PMU_REG41 |= AON_PMU_REG41_BIT_XTAL_SEL
#define AON_PMU_IS_XTAL_SEL_40M                         ((AON_PMU_REG41 & AON_PMU_REG41_BIT_XTAL_SEL) == 1)

#define AON_PMU_REG03            		            (*((volatile unsigned int *)(BK3000_PMU_BASE_ADDR + 0x3*4)))

#define AON_PMU_REG03_BIT_BOOT_FLAG                 0x1
#define AON_PMU_REG03_SET_BF_PRIMARY                AON_PMU_REG03 |= AON_PMU_REG03_BIT_BOOT_FLAG
#define AON_PMU_REG03_CLR_BF_PRIMARY                AON_PMU_REG03 &= ~AON_PMU_REG03_BIT_BOOT_FLAG

#define DEEP_SLEEP_RESTART_BIT		(0x1 << 1)
// 1: Boot from deep_sleep  0: Boot from POR
#define DEEP_SLEEP_RESTART   ((BK3000_PMU_RESET_REASON_GET & DEEP_SLEEP_RESTART_BIT ) != 0)


//uart enable _ok
#define addSYSTEM_Reg0xc                            *((volatile unsigned long *) (0x44010000+0xc*4))
#define UART0_ENABLE                                addSYSTEM_Reg0xc |= 0x4
#define UART0_DISABLE                               addSYSTEM_Reg0xc &= ~0x4
#define UART0_RESET                                 REG_APB3_UART_RST = 1


//spi enable _ok
#define addSYSTEM_Reg0xa                       (*((volatile unsigned int *)(BK3000_SYS_BASE_ADDR + 0xa*4)))
#define SPI0_CLK_80M                           addSYSTEM_Reg0xa |= (0x2 << 4)
#define SPI0_ENABLE                            addSYSTEM_Reg0xc |= 0x2
#define SPI0_DISABLE                            addSYSTEM_Reg0xc &= ~0x2

#define PER_INT_ENABLE   *((volatile unsigned long *) (0x44010000+0x20*4))
#define UART0_INT_INDEX_NUM          4
#define UART0_INT_INDEX         (0x1U << 4 )
#define UART0_INT_ENABLE   PER_INT_ENABLE |=  UART0_INT_INDEX
#define UART0_INT_DISABLE  PER_INT_ENABLE &=  ~UART0_INT_INDEX

/////////////////

// flash_rw_sel & rebooot   ok


#define addSYSTEM_Reg0x2                                        *((volatile unsigned long *) (0x44010000+0x2*4))
#define REBOOT                                                  addSYSTEM_Reg0x2 &= ~0x1
#define  SPI_FLASH_SEL             (0x1U << 9 )
#define  SET_SPI_RW_FLASH          addSYSTEM_Reg0x2 |= SPI_FLASH_SEL
#define  SET_FLASHCTRL_RW_FLASH    addSYSTEM_Reg0x2 &= ~SPI_FLASH_SEL


uint32_t uart_get_clock_freq(void);
#define UART_CLOCK_FREQ      uart_get_clock_freq()
#define UART_CLOCK_FREQ_26M  26000000
#define UART_CLOCK_FREQ_40M  40000000

#endif

////////////////// CHANGE /////////////////////

//////////////////////////////////////
// Pherial Register's Define  

