Sparkleiot/BK7239N_AT/components/bk_mcuboot/bl2/components/download/bl_bk_reg.h
//GPIO
#define BK3000_GPIO_0_CONFIG                 (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+0*4)))
#define BK3000_GPIO_1_CONFIG                 (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+1*4)))

#define BK3000_GPIO_6_CONFIG                 (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+6*4)))
#define BK3000_GPIO_7_CONFIG                 (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+7*4)))
#define BK3000_GPIO_8_CONFIG                 (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+8*4)))
#define BK3000_GPIO_9_CONFIG                 (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+9*4)))

#define BK3000_GPIO_10_CONFIG                (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+10*4)))
#define BK3000_GPIO_11_CONFIG                (*((volatile unsigned long *)(BK3000_GPIO_BASE_ADDR+11*4)))

#define sft_GPIO_INPUT                      0
#define sft_GPIO_OUTPUT                     1
#define sft_GPIO_INPUT_ENABLE               2
#define sft_GPIO_OUTPUT_ENABLE              3
#define sft_GPIO_PULL_MODE                  4
#define sft_GPIO_PULL_ENABLE                5

#define sft_GPIO_FUNCTION_ENABLE            6

#define sft_GPIO_INPUT_MONITOR              7

 /* defination of registers
*/
#define REG_APB3_UART_RST                   (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x02*4)))
#define REG_APB3_UART_CFG                   (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x04*4)))
#define REG_APB3_UART_FIFO_THRESHOLD        (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x05*4)))
#define REG_APB3_UART_FIFO_STATUS           (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x06*4)))
#define REG_APB3_UART_DATA                  (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x07*4)))
#define REG_APB3_UART_INT_ENABLE            (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x08*4)))
#define REG_APB3_UART_INT_FLAG              (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x09*4)))
#define REG_APB3_UART_FC_CFG                (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x0A*4)))
#define REG_APB3_UART_WAKEUP_ENABLE         (*((volatile unsigned long *)(BK3000_UART_BASE_ADDR+0x0B*4)))

#define UART_WRITE_BYTE(v) (REG_APB3_UART_DATA=v)
#define UART_READ_BYTE()  ((REG_APB3_UART_DATA>>8)&0xff)

#define bit_UART_TX_FIFO_FULL                (1<<16)

#define bit_UART_TX_FIFO_EMPTY               (1<<17)
#define bit_UART_RX_FIFO_FULL                (1<<18)
#define bit_UART_RX_FIFO_EMPTY               (1<<19)
#define bit_UART_TX_WRITE_READY              (1<<20)
#define bit_UART_RX_READ_READY               (1<<21)

#define sft_UART_CONF_TX_ENABLE          0
#define sft_UART_CONF_RX_ENABLE          1
#define sft_UART_CONF_IRDA               2
#define sft_UART_CONF_UART_LEN           3
#define sft_UART_CONF_PAR_EN             5
#define sft_UART_CONF_PAR_MODE           6
#define sft_UART_CONF_STOP_LEN           7
#define sft_UART_CONF_CLK_DIVID          8

#define sft_UART_FIFO_CONF_TX_FIFO       0
#define sft_UART_FIFO_CONF_RX_FIFO       8
#define sft_UART_FIFO_CONF_DETECT_TIME   16


#define bit_UART_INT_TX_NEED_WRITE       ( 1 << 0 )
#define bit_UART_INT_RX_NEED_READ        ( 1 << 1 )
#define bit_UART_INT_RX_OVER_FLOW        ( 1 << 2 )
#define bit_UART_INT_RX_PAR_ERR          ( 1 << 3 )
#define bit_UART_INT_RX_STOP_ERR         ( 1 << 4 )
#define bit_UART_INT_TX_STOP_END         ( 1 << 5 )
#define bit_UART_INT_RX_STOP_END         ( 1 << 6 )
#define bit_UART_INT_RXD_WAKEUP          ( 1 << 7 )





#define UART_TX_FIFO_SIZE       128
#define UART_RX_FIFO_SIZE       128
#define UART_TX_FIFO_COUNT      (REG_APB3_UART_FIFO_STATUS&0xff)
#define UART_RX_FIFO_COUNT      ((REG_APB3_UART_FIFO_STATUS>>8)&0xff)
#define UART_TX_FIFO_FULL        (REG_APB3_UART_FIFO_STATUS&0x00010000)
#define UART_TX_FIFO_EMPTY       (REG_APB3_UART_FIFO_STATUS&0x00020000)
#define UART_RX_FIFO_FULL        (REG_APB3_UART_FIFO_STATUS&0x00040000)
#define UART_RX_FIFO_EMPTY       (REG_APB3_UART_FIFO_STATUS&0x00080000)
#define UART_TX_WRITE_READY      (REG_APB3_UART_FIFO_STATUS&0x00100000)
#define UART_RX_READ_READY       (REG_APB3_UART_FIFO_STATUS&0x00200000)

#define UART_BAUDRATE_3250000   3250000
#define UART_BAUDRATE_3000000   3000000
#define UART_BAUDRATE_2000000   2000000
#define UART_BAUDRATE_921600    921600  //
#define UART_BAUDRATE_460800    460800
#define UART_BAUDRATE_256000    256000
#define UART_BAUDRATE_230400    230400  //
#define UART_BAUDRATE_115200    115200  //default
#define UART_BAUDRATE_9600      9600  
#define UART_BAUDRATE_3000      3250  //

#define UART_BAUDRATE_DEFAULE    UART_BAUDRATE_115200 //UART_BAUDRATE_3000000
#define UART_CLOCK_FREQ_26M  26000000
#define UART_CLOCK_FREQ_48M  48000000
#define UART_CLOCK_FREQ_24M  24000000
#define UART_CLOCK_FREQ_52M  52000000



#define Beken_Write_Register(addr, data) (*((volatile uint32_t *)(addr))) = (uint32_t)(data);
#define Beken_Read_Register(addr) (*(volatile uint32_t *)(addr));


#ifdef FLASH_DEBUG
//////////////////////////////////////
//FLASH
#define BIT_ADDRESS_SW                 0
#define BIT_OP_TYPE_SW                 24
#define BIT_OP_SW                      29
#define BIT_WP_VALUE                   30
#define BIT_BUSY_SW                    31

#define SET_ADDRESS_SW                 (0xFFFFFF << BIT_ADDRESS_SW)
#define SET_OP_TYPE_SW                 (0x1F     << BIT_OP_TYPE_SW)
#define SET_OP_SW                      (0x1      << BIT_OP_SW)
#define SET_WP_VALUE                   (0x1      << BIT_WP_VALUE)
#define SET_BUSY_SW                    (0x1      << BIT_BUSY_SW)

#define BIT_FLASH_CLK_CONF             0
#define BIT_MODE_SEL                   4
#define BIT_FWREN_FLASH_CPU            9
#define BIT_WRSR_DATA                  10
#define BIT_CRC_EN                     26

#define SET_FLASH_CLK_CONF             (0xF      << BIT_FLASH_CLK_CONF)
#define SET_MODE_SEL                   (0x1F     << BIT_MODE_SEL)
#define SET_FWREN_FLASH_CPU            (0x1      << BIT_FWREN_FLASH_CPU)
#define SET_WRSR_DATA                  (0xFFFF   << BIT_WRSR_DATA)
#define SET_CRC_EN                     (0x1      << BIT_CRC_EN)

#define BIT_SR_DATA_FLASH              0
#define BIT_CRC_ERR_COUNTER            8
#define BIT_DATA_FLASH_SW_SEL          16
#define BIT_DATA_SW_FLASH_SEL          19

#define SET_SR_DATA_FLASH              (0xFF     << BIT_SR_DATA_FLASH)
#define SET_CRC_ERR_COUNTER            (0xFF     << BIT_CRC_ERR_COUNTER)
#define SET_DATA_FLASH_SW_SEL          (0x7      << BIT_DATA_FLASH_SW_SEL)
#define SET_DATA_SW_FLASH_SEL          (0x7      << BIT_DATA_SW_FLASH_SEL)

#define reg_FLASH_OPERATE_SW           (*((volatile unsigned long *)    (BK3000_FLASH_BASE_ADDR+0*4)))
#define reg_FLASH_DATA_SW_FLASH        (*((volatile unsigned long *)    (BK3000_FLASH_BASE_ADDR+1*4)))
#define reg_FLASH_DATA_FLASH_SW        (*((volatile unsigned long *)    (BK3000_FLASH_BASE_ADDR+2*4)))
#define reg_FLASH_RDID_DATA_FLASH      (*((volatile unsigned long *)    (BK3000_FLASH_BASE_ADDR+4*4)))
#define reg_FLASH_SR_DATA_CRC_CNT      (*((volatile unsigned long *)    (BK3000_FLASH_BASE_ADDR+5*4)))
#define reg_FLASH_CONF                 (*((volatile unsigned long *)    (BK3000_FLASH_BASE_ADDR+7*4)))

#endif //

#endif
// end of file


